- 데이터사이언스스쿨

- 4.1.1
- 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다. -- 이 말은 공통도 있어야 한다는?

- 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [4]:
import numpy as np
import pandas as pd

In [52]:
a = pd.Series([23,69,45,85],
            index = ['A','B','C','D'])
b = pd.Series([74,69,32,58],
            index = ['C','D','E','F'])
a, b

(A    23
 B    69
 C    45
 D    85
 dtype: int64,
 C    74
 D    69
 E    32
 F    58
 dtype: int64)

In [53]:
a + b

A      NaN
B      NaN
C    119.0
D    154.0
E      NaN
F      NaN
dtype: float64

In [54]:
AB = a+b
AB.isna()

A     True
B     True
C    False
D    False
E     True
F     True
dtype: bool

In [55]:
a-b

A     NaN
B     NaN
C   -29.0
D    16.0
E     NaN
F     NaN
dtype: float64

In [56]:
AB = a-b
AB.isna()

A     True
B     True
C    False
D    False
E     True
F     True
dtype: bool

In [57]:
a*b

A       NaN
B       NaN
C    3330.0
D    5865.0
E       NaN
F       NaN
dtype: float64

In [58]:
AB = a*b
AB.isna()

A     True
B     True
C    False
D    False
E     True
F     True
dtype: bool

In [59]:
a%b

A     NaN
B     NaN
C    45.0
D    16.0
E     NaN
F     NaN
dtype: float64

In [60]:
AB = a%b
AB.isna()

A     True
B     True
C    False
D    False
E     True
F     True
dtype: bool

- 4.1.2

- 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

- (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

- (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [61]:
data = {
    '학년':[1,2,3,4,5],
    '출석여부':['출석','출석','지각','결석','조퇴'],
    '성적':[85.7,46.0,89.3,92.7,88.2],
    '등교수단':['버스','통학','기숙사','자전거','지하철'],
    '사물함갯수':[2,3,1,0,1]
}
index = ['소의','명희','연지','진주','채준']
df = pd.DataFrame(data, index=index)
df

    학년 출석여부    성적 등교수단  사물함갯수
소의   1   출석  85.7   버스      2
명희   2   출석  46.0   통학      3
연지   3   지각  89.3  기숙사      1
진주   4   결석  92.7  자전거      0
채준   5   조퇴  88.2  지하철      1

- 4.1.3
- 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [62]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

- (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

In [63]:
# df를 s로 
df['수학']

# Q 모든 학생들의 점수를 시리즈로 나타내라 ?

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

- (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [64]:
df[['국어','영어']][:]

# 데프는 index 자리에 리스트값이 들어오면 O

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [65]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

- (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [66]:
# T
df['T평균']=df.mean(axis=1).round(2)
df

    국어  영어  수학    T평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [67]:
df.values       # 넘파이 배열 출력

array([[80.  , 90.  , 90.  , 86.67],
       [90.  , 70.  , 60.  , 73.33],
       [70.  , 60.  , 80.  , 70.  ],
       [30.  , 40.  , 70.  , 46.67]])

In [68]:
df['T평균2']=np.mean(df.values[:,:3],axis=1).round(2)
df

# 이렇게도 만들 수 있
# df.values[:,:3] 는 국,영,수 만 평균 구하기 위한 슬라이스

    국어  영어  수학    T평균   T평균2
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  40  70  46.67  46.67

- (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

In [69]:
# T 먼저 원래의 df로 만들기 
df.drop(columns=['T평균','T평균2'],inplace=True)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [73]:
# T 
df['영어']['방자'] = 80
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [74]:
# T 
df['평균']=df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [ ]:
# T : another tip  
import warnings
warnings.filterwarnings('ignore')

# 워닝메세지 보기 싫을 때

In [70]:
df.mean(axis=1)

춘향    86.666667
몽룡    73.333333
향단    70.000000
방자    46.666667
dtype: float64

In [76]:
df['영어']['방자'] = 80
df['과목평균'] = df.mean(axis=1).round(2)       # 잘했네! [ ] 넣어서 틀렸네 구성외우자 
df

<ipython-input-76-ee08af4b41bd>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80

    국어  영어  수학     평균   과목평균
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  80  70  60.00  60.00

In [ ]:
a

A    23
B    69
C    45
D    85
dtype: int64

- (5) 춘향의 점수를 데이터프레임으로 나타낸다.

In [80]:
df

    국어  영어  수학     평균   과목평균
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  80  70  60.00  60.00

In [78]:
# T 
df.head(1)

# 행 단위로 춘향이 데프로 뽑아냄

    국어  영어  수학     평균   과목평균
춘향  80  90  90  86.67  86.67

In [79]:
# T 향단이 뽑기 
df.head(3).tail(1)

    국어  영어  수학    평균  과목평균
향단  70  60  80  70.0  70.0

In [81]:
df. T       #전치 
            # 평균 때문에 모든 값이 실수형으로

         춘향     몽룡    향단    방자
국어    80.00  90.00  70.0  30.0
영어    90.00  70.00  60.0  80.0
수학    90.00  60.00  80.0  70.0
평균    86.67  73.33  70.0  60.0
과목평균  86.67  73.33  70.0  60.0

In [82]:
# 전치해서 춘향이 뽑기 : 전치에 리스트 넣기 
df.T[['춘향']]

         춘향
국어    80.00
영어    90.00
수학    90.00
평균    86.67
과목평균  86.67

In [83]:
df[:'춘향']

    국어  영어  수학     평균   과목평균
춘향  80  90  90  86.67  86.67

In [ ]:
df[['국어','영어','수학']]['춘향']

KeyError: '춘향'

- (6) 향단의 점수를 시리즈로 나타낸다.

In [85]:
df

    국어  영어  수학     평균   과목평균
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  80  70  60.00  60.00

In [84]:
# T 
df.T['향단']

국어      70.0
영어      60.0
수학      80.0
평균      70.0
과목평균    70.0
Name: 향단, dtype: float64

In [ ]:
df[['국어','영어','수학']]['향단']

KeyError: '향단'

- 4.3.1

- 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

- 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [87]:
# T 
df=pd.DataFrame(np.arange(25).reshape(5,5), columns=list('ABCDE'), index=list('vwxyz'))
df

    A   B   C   D   E
v   0   1   2   3   4
w   5   6   7   8   9
x  10  11  12  13  14
y  15  16  17  18  19
z  20  21  22  23  24

In [96]:
# T : 12 
# 인덱싱 [열,행]
df['C']['x'],   df['C'][2],    df.C['x'],  df.C[2],     df.C.x

(12, 12, 12, 12, 12)

In [97]:
# T : 12 
# loc indexor [행,열]
df.loc['x','C'],    df.loc['x'][2],     df.loc['x']['C']

(12, 12, 12)

In [99]:
# T : 12 
# iloc indexor [행,열]
df.iloc[2,2],   df.iloc[2]['C'],    df.iloc[2][2]

(12, 12, 12)

In [ ]:
data = {
    'a':[1,2,3,4,5],
    'b':[6,7,8,9,10],
    'c':[11,12,13,14,15],
    'd':[16,17,18,19,20],
    'e':[21,22,23,24,25]
}
index = ['one','two','three','four','five']
df = pd.DataFrame(data, index=index)
df

       a   b   c   d   e
one    1   6  11  16  21
two    2   7  12  17  22
three  3   8  13  18  23
four   4   9  14  19  24
five   5  10  15  20  25

In [ ]:
df['a']

one      1
two      2
three    3
four     4
five     5
Name: a, dtype: int64

In [ ]:
df.a

one      1
two      2
three    3
four     4
five     5
Name: a, dtype: int64

In [ ]:
df['a']['one'] , df['a'][0]

(1, 1)

In [ ]:
df.loc['two','a']

2

In [ ]:
df.loc['two'][1]

7

In [ ]:
df.iloc[2,4]

23

- 4.4

In [6]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

- 1 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [7]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [16]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [34]:
t = titanic.sort_values(['sex','age','class','alive'])

In [35]:
t

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
172,1,3,female,1.00,1,1,11.1333,S,Third,child,False,NaN,Southampton,yes,False
381,1,3,female,1.00,0,2,15.7417,C,Third,child,False,NaN,Cherbourg,yes,False
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
444,1,3,male,NaN,0,0,8.1125,S,Third,man,True,NaN,Southampton,yes,True
643,1,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
692,1,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
709,1,3,male,NaN,1,1,15.2458,C,Third,man,True,NaN,Cherbourg,yes,False
828,1,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,yes,True

In [37]:
t.value_counts() 
# 정렬은 했는데 연령별 , 별.. 총합 구하는 걸 모르겟다.

survived  pclass  sex     age   sibsp  parch  fare      embarked  class  who    adult_male  deck  embark_town  alive  alone
1         1       female  24.0  0      0      69.3000   C         First  woman  False       B     Cherbourg    yes    True     2
                          58.0  0      0      26.5500   S         First  woman  False       C     Southampton  yes    True     1
                          49.0  0      0      25.9292   S         First  woman  False       D     Southampton  yes    True     1
                                1      0      76.7292   C         First  woman  False       D     Cherbourg    yes    False    1
                          50.0  0      1      247.5208  C         First  woman  False       B     Cherbourg    yes    False    1
                                                                                                                              ..
                          16.0  0      0      86.5000   S         First  woman  False       B     Southampton  yes    True     1
                                       1      39.4000   S         First  woman  False       D     Southampton  yes    False    1
                                              57.9792   C         First  woman  False       B     Cherbourg    yes    False    1
                          17.0  1      0      57.0000   S         First  woman  False       B     Southampton  yes    False    1
          3       male    32.0  0      0      8.0500    S         Third  man    True        E     Southampton  yes    True     1
Length: 181, dtype: int64

- 3. 타이타닉호 승객의 평균 나이를 구하라.

In [52]:
titanic.age.mean()

29.69911764705882

- 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

- 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.